app/search/SearchUser.php

    private function is_books_exists($query, $params) {
        $books = [];
        $subQuery = LendingOutBook::find()->select(['client_id'])->all();
---
SELECT "client_id" FROM "lending_out_books"