app/forms/SignUpForm.php

    public function signup()
    {

        if (!$this->validate()) {
            var_dump($this->errors);
            return null;
        }

        $user = new User();
        $user->full_name = $this->full_name;
        $user->username = $this->username;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->role_id = Role::CLIENT;
        $user->save();
---
INSERT INTO "users" ("full_name", "username", "password", "auth_key", "role_id", "passport") VALUES ('Test Test Test', 'User', '$2y$13$xVlzMeTjmTRMDzHTuGhSwOyA3nhpt.AOWO.VHbKCS8lNxfNUKmrui', '1JXKwtjn03hI9B1TCJmwZPYdXyLyjygk', 1, NULL) RETURNING "id"