app/views/user/_form.php

SELECT * FROM "roles"
---
    <?= $form->field($model, 'password')->passwordInput(['maxlength' => true]) ?>

    Role:
    <?= Html::activeDropDownList($model, 'role_id',
        ArrayHelper::map(\app\models\Role::find()->asArray()->all(), 'id', 'name')) ?>