app/views/user/index.php

                'attribute' => 'role',
                'value' => 'id',
                'filter' => Html::activeDropDownList($searchModel, 'id',
                    ArrayHelper::map(\app\models\Role::find()->asArray()->all(), 'id', 'name'),
---
SELECT * FROM "roles"