app/controllers/LendingOutBookController.php

SELECT * FROM "books" WHERE "is_active"=TRUE
SELECT * FROM "users" WHERE "role_id"=2
SELECT * FROM "users" WHERE "role_id"=1
INSERT INTO "lending_out_books" ("book_id", "employee_id", "client_id", "date_expiration", "date_of_issue") VALUES (2, 2, 4, '2022-03-30T11:11', NOW()) RETURNING "id"
SELECT EXISTS(SELECT * FROM "books" WHERE "books"."id"='2')
SELECT * FROM "books" WHERE "id"='2'
UPDATE "books" SET "is_active"=FALSE WHERE "id"=2
---
    public function actionCreate()
    {
        $model = new LendingOutBook();

        $books = Book::find()->where(['is_active' => true])->all();
        $employees = User::find()->where(['role_id' => Role::EMPLOYEE])->asArray()->all();
        $clients = User::find()->where(['role_id' => Role::CLIENT])->asArray()->all();

        if ($this->request->isPost) {

            if ($model->load($this->request->post()) && $model->save()) {
                $book = Book::findOne($this->request->post()["LendingOutBook"]['book_id']);
                $book->is_active = false;
                $book->save();

SELECT * FROM "books" WHERE "is_active"=TRUE
SELECT * FROM "users" WHERE "role_id"=2
SELECT * FROM "users" WHERE "role_id"=1
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $books = Book::find()->where(['is_active' => true])->all();
        $employees = User::find()->where(['role_id' => Role::EMPLOYEE])->asArray()->all();
        $clients = User::find()->where(['role_id' => Role::CLIENT])->asArray()->all();

SELECT * FROM "lending_out_books" WHERE "id"='2'
---
    protected function findModel($id)
    {
        if (($model = LendingOutBook::findOne(['id' => $id])) !== null) {