app/controllers/ReturnBookController.php

    public function actionCreate()
    {
        $model = new ReturnBook();

        // Данные для формы
        $books = Book::find()->where(['is_active' => false])->all();
        $employees = User::find()->where(['role_id' => Role::EMPLOYEE])->asArray()->all();
        $states = BookState::find()->asArray()->all();

        if ($this->request->isPost) {
            if($this->request->post()){
                $params = $this->request->post()["ReturnBook"];

                // удаляем к книгу у пользователя
                $lending_out_book = LendingOutBook::find()->where(['book_id' => $params['book_id']])->one();
                if ($lending_out_book){
                    $params = array_merge($params, ['client_id' => $lending_out_book['client_id']]);
                    $lending_out_book->delete();
                } else {
                    $model->loadDefaultValues();
                }

                // делаем книгу активной для выдачи
                $book = Book::findOne($params['book_id']);
                $book->is_active = true;
                $book->save();
---
SELECT * FROM "books" WHERE "is_active"=FALSE
SELECT * FROM "users" WHERE "role_id"=2
SELECT * FROM "book_states"
SELECT * FROM "lending_out_books" WHERE "book_id"='3'
DELETE FROM "lending_out_books" WHERE "id"=2
SELECT EXISTS(SELECT * FROM "books" WHERE "books"."id"='3')
SELECT * FROM "books" WHERE "id"='3'
UPDATE "books" SET "is_active"=TRUE WHERE "id"=3

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $books = Book::find()->where(['is_active' => false])->all();
        $employees = User::find()->where(['role_id' => Role::EMPLOYEE])->asArray()->all();
        $states = BookState::find()->asArray()->all();
---
SELECT * FROM "books" WHERE "is_active"=FALSE
SELECT * FROM "users" WHERE "role_id"=2
SELECT * FROM "book_states"

    protected function findModel($id)
    {
        if (($model = ReturnBook::findOne(['id' => $id])) !== null) {
---
SELECT * FROM "return_books" WHERE "id"='1'