app/controllers/UserController.php

SELECT * FROM "lending_out_books" WHERE "client_id"=1
---
    public function actionView($id)
    {
        $model = $this->findModel($id);
//        $model['role'] = $model->getRole()->one()->name;
        $data = [];
        // Достаем все книги пользователя и записываем в массив для использования в виджете
        foreach($model->getClientLendingOutBooks()->all() as $LendingOutBook) {

INSERT INTO "users" ("full_name", "position", "passport", "username", "password", "role_id", "auth_key") VALUES ('asd', '321', 123, 'asd2', '$2y$13$1Deng3lJjJvVQvGleErQoeXcJCs4bbjnh9zfhHTvLmUTqw5FaRdfq', 1, 'MckXCd8kohgPggc4qtLVLMazcewDSdjh') RETURNING "id"
---
    public function actionCreate()
    {
        $model = new User();

        if ($this->request->isPost) {
            if ($model->load($this->request->post())) {
                $model->generateAuthKey();
                $model->setPassword($this->request->post()["User"]["password"]);
                if ($model->save()) {

SELECT * FROM "users" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = User::findOne(['id' => $id])) !== null) {