app/models/User.php

SELECT * FROM "users" WHERE "id"=3
---
    public static function findIdentity($id): ?User
    {
        $user = User::findOne($id);